[{"code":50001,"name":"Failed Download","description":"The receiving Competent Authority could not download the referenced file.","action":"Please resubmit the file"},
{"code":50002,"name":"Failed Decryption","description":"The receiving Competent Authority could not decrypt the referenced file.","action":"Please re-encrypt the file with a valid key and resubmit the file."},
{"code":50003,"name":"Failed Decompression","description":"The receiving Competent Authority could not decompress the referenced file.","action":"Please compress the file (before encrypting) and resubmit the file."},
{"code":50004,"name":"Failed Signature Check","description":"The receiving Competent Authority could not validate the digital signature on the referenced file.","action":"Please re-sign the file with the owner’s private key using procedures as defined in the context of the common approach to file preparation."},
{"code":50005,"name":"Failed Threat Scan","description":"The receiving Competent Authority detected one or more potential security threats within the decrypted version of the referenced file. Such threats include but are not limited to hyperlinks, Java script, and executable files","action":"Please scan the file for known threats and viruses, remove all detected threats and viruses prior to encryption and re-encrypt and resubmit the file."},
{"code":50006,"name":"Failed Virus Scan","description":"The receiving Competent Authority detected one or more known viruses within the decrypted version of the referenced file.","action":"Please scan the file for known threats and viruses, remove all detected threats and viruses prior to encryption, and re-encrypt and resubmit the file."},
{"code":50007,"name":"Failed Schema Validation","description":"The referenced file failed validation against the ABC XML Schema.","action":"Please re-validate the file against the ABC XML Schema, resolve any validation errors, and re- encrypt and resubmit the file. When the Metadata.FileFormatCd is different than XML (e.g. JPEG or PDF), the file will be sent with the CTS Wrapper for non-Xml files. In such a case the file error 50007 will indicates that the Xml file failed the validation against the CTS Wrapper (for non-Xml files) schema."},
{"code":50008,"name":"Invalid MessageRefID format","description":"The structure of the MessageRefID is not in the correct format, as set out in the ABC User Guide.","action":"Please ensure the MessageRefID follows structure defined in the ABC User guide, and resubmit the file."},
{"code":50009,"name":"MessageRefID has already been used","description":"The referenced file has a duplicate MessageRefID value that was received on a previous file.","action":"Please replace the MessageRefID field value with a unique value (not containing all blanks), and resubmit the file."},
{"code":50010,"name":"File Contains Test Data for Production Environment","description":"The referenced file contains one or more records with a DocTypeIndic value in the range OECD11-OECD13, indicating test data. As a result, the receiving Competent Authority cannot accept this file as a valid ABC file submission. For more information on the DocTypeIndic data element, please consult the ABC User Guide. The file error 50010 will only apply if the ABC schema contains a correctable record. A correctable record contains a DocSpec (and a DocTypeIndic), thus allowing for future corrections. For example, the CDQ schema does not contain correctable records, so the file error 50010 cannot be used in the context of the CDQ schema. Similarly, if the ABC message is using the CTS Wrapper for non-Xml files (e.g. an EOIR PDF file), then file error 50010 cannot be used.","action":"If this file was intended to be submitted as a valid ABC file, please resubmit with DocTypeIndic values in the range OECD1-OECD3 (see ABC User guide)."},
{"code":50011,"name":"File Contains Production Data for Test Environment","description":"The referenced file was received in a test environment with one or more records having a DocTypeIndic value in the range OECD1-OECD3. These DocTypeIndic values indicate data in this file may have been intended as a valid ABC file submission. ABC messages received in test environments are not accepted by the receiving Competent Authority as a valid ABC file submission. Submissions to the test environment should only include records with DocTypeIndic in the range OECD11-OECD13, indicating test files. The file error 50011 will only apply if the ABC schema contains a correctable record. A correctable record contains a DocSpec (and a DocTypeIndic), thus allowing for future corrections. For example, the CDQ schema does not contain correctable records, so the file error 50011 cannot be used in the context of the CDQ schema. Similarly, if the ABC message is using the CTS Wrapper for non-Xml files (e.g. an EOIR PDF file), then file error 50011 cannot be used.","action":"If this file was intended to be submitted as a valid ABC file, please resubmit with DocTypeIndic values in the range OECD1-OECD3. If this file was intended as a test file, please correct the DocTypeIndic for all records and resubmit."},
{"code":50012,"name":"The received message is not meant to be received by the indicated jurisdiction","description":"The records contained in the ABC payload file are not meant for the receiving Competent Authority, but should have been provided to another jurisdiction","action":"The file is to be immediately deleted by the initial, erroneous receiver and that receiving Competent Authority will promptly notify the sending Competent Authority about the erroneous transmission through the ABC Status Message XML Schema."},
{"code":50013,"name":"The AES key size has been detected as incorrect by the receiving jurisdiction","description":"The recipient has detected one or more of the following errors:‒ Data packet transmitted with ECB cipher mode (or any cipher mode other than CBC);‒ Data packet does not include IV in Key File;‒ Data packet key size is not 48 bytes; or‒ Data packet does not contain the concatenated key and IV.","action":"The sending Competent Authority should resend the file (newly encrypted, with a new unique MessageRefID and with the correct AES key size)."},
{"code":50014,"name":"The Message Type in the Generic Status Message does not match with the Message Type in the Metadata","description":"The message type specified in the Generic Status Message (MessageSpec.MesageType) does not match the message type specified in the Metadata (Metadata.CTSCommunicationTypeCd).","action":"The sending Competent Authority should resend the file and make sure the Message Type in the Generic Status Message does match with the Message Type in the Metadata."},
{"code":80000,"name":"DocRefID already used","description":"The DocRefID is already used for another record.","action":""},
{"code":80001,"name":"DocRefID format","description":"The structure of the DocRefID is not in the correct format, as set out in the User Guide.","action":""},
{"code":80002,"name":"CorrDocRefId unknown","description":"The CorrDocRefId refers to an unknown record.","action":""},
{"code":80003,"name":"CorrDocRefId no longer valid","description":"The corrected record is no longer valid (invalidated or outdated by a previous correction message). As a consequence, no further information should have been received on this version of the record.","action":""},
{"code":80004,"name":"CorrDocRefId for new data","description":"The initial element specifies a CorrDocRefId.","action":""},
{"code":80005,"name":"Missing CorrDocRefId","description":"The corrected element does not specify any CorrDocRefId.","action":""},
{"code":80006,"name":"DocSpec. CorrMessage RefID","description":"The CorrMessageRefID is forbidden within the DocSpec_Type.","action":""},
{"code":80007,"name":"MessageSpec. CorrMessage RefID","description":"The CorrMessageRefID is forbidden within the Message Header. Please consult the relevant user guide to know if the MessageSpec.CorrMessage RefID can be used under certain conditions.","action":""},
{"code":80008,"name":"Resend option","description":"Resend option (OECD0) cannot be used for the correctable record specified (please consult the relevant user guide to know for which correctable record the Resend option can be used).","action":""},
{"code":80009,"name":"Delete Parent record","description":"The Parent record cannot be deleted without deleting all related Child records (either in same message or in previous messages).","action":""},
{"code":80010,"name":"Message TypeIndic","description":"A message can contain either new records (OECD1) or corrections/deletions (OECD2 and OECD3), but cannot contain a mixture of both.","action":""},
{"code":80011,"name":"CorrDocRefID twice in same message","description":"The same DocRefID cannot be corrected or deleted twice in the same message.","action":""},
{"code":80013,"name":"Resend option, unknown DocRefID","description":"An unknown DocRefID was specified for the Resend option (OECD0).","action":""},
{"code":80014,"name":"Resend option, DocRefID is no longer valid","description":"The DocRefID specified for the Resend option (OECD0) is no longer valid (invalidated or outdated by a previous correction message).","action":""},
{"code":99999,"name":"Custom error","description":"The received message contains an error for which no specific error code exists. The details must specify what the error is.","action":""},
{"code":60000,"name":"Account Number IBAN","description":"The Account Number must follow the IBAN structured number format when the Account Number type= OECD601 – IBAN.","action":""},
{"code":60001,"name":"Account Number ISIN","description":"The Account Number must follow the ISIN structured number format when the Account Number type= OECD603 – ISIN.","action":""},
{"code":60002,"name":"Account Balance","description":"The account balance entered was less than zero. This amount must be greater than or equal to zero.","action":""},
{"code":60003,"name":"Account Balance and Closed account","description":"The Account Balance must be zero if account was indicated as closed in the account closed attribute.","action":""},
{"code":60004,"name":"Person.Name type invalid","description":"Name type selected is invalid, i.e. corresponds to the value not used for CRS: OECD201= SMFAliasOrOther","action":""},
{"code":60005,"name":"Controlling Person type must be omitted","description":"When the Account Holder is an Organisation and the 'Account Holder Type' is CRS102 or CRS103, the 'Controlling Person Type' must be omitted. (CRS102= CRS Reportable Person; CRS103= Passive Non-Financial Entity that is a CRS Reportable Person)","action":""},
{"code":60006,"name":"Controlling Person must be provided","description":"When the Account Holder is an Organisation and the 'Account Holder Type' is CRS101, the 'Controlling Person' must be provided. (CRS101= Passive Non-Financial Entity with - one or more controlling person that is a Reportable Person)","action":""},
{"code":60007,"name":"Reporting Group","description":"The Reporting Group cannot be repeated.","action":""},
{"code":60008,"name":"Sponsor","description":"Sponsor cannot be provided.","action":""},
{"code":60009,"name":"Intermediary","description":"Intermediary cannot be provided","action":""},
{"code":60010,"name":"Pool Report","description":"Pool Report cannot be provided.","action":""},
{"code":60011,"name":"Verify data sorting Person ResCountry Code","description":"When the Person is a Controlling Person or an Individual Account Holder, at least one of the according ResCountryCodes must match the Message Receiving Country Code","action":""},
{"code":60012,"name":"Verify data sorting Organisation ResCountry Code","description":"At least one of either the Entity Account Holder ResCountryCode or Controlling Person ResCountryCode must match the Message Receiving Country Code.","action":""},
{"code":60013,"name":"Verify data sorting ReportingFI. ResCountry Code","description":"ReportingFI.ResCountryCode should always be provided and it must match the Message Sending Country Code","action":""},
{"code":60014,"name":"BirthDate","description":"Date of birth should be in a valid range (e.g. not before 1900 and not after the current year).","action":""},
{"code":60015,"name":"AccountReport","description":"AccountReport can only be omitted if ReportingFI is being corrected/deleted or, in the case of domestic reporting, if there is nil reporting. If the ReportingFI indicates new data or resent, then AccountReport must be provided.","action":""},
{"code":60016,"name":"Controlling Person must be omitted (when the Account Holder is an individual)","description":"When the Account Holder is an individual, the “Controlling Person” must be omitted.","action":""},
{"code":70000,"name":"Message.MessageRefID","description":"","action":"Validation."},
{"code":70001,"name":"Individual Account Holder. TIN","description":"","action":"Mandatory"},
{"code":70002,"name":"Individual Account Holder. Name. FirstName","description":"","action":"Validation Note: Use “NFN” for No First Name."},
{"code":70003,"name":"Individual Account Holder. Name. LastName","description":"","action":"Validation."},
{"code":70004,"name":"Individual Account Holder. Address. AddressFix.City","description":"","action":"Validation If AddressFix is selected"},
{"code":70005,"name":"Individual Account Holder. Address. AddressFree","description":"","action":"Validation If AddressFree is selected"},
{"code":70006,"name":"Controlling Person. TIN","description":"","action":"Mandatory"},
{"code":70007,"name":"Controlling Person. Name. FirstName","description":"","action":"Validation Note: Use “NFN” for No First Name."},
{"code":70008,"name":"Controlling Person. Name. LastName","description":"","action":"Validation"},
{"code":70009,"name":"Controlling Person. Address. AddressFix.City","description":"","action":"Validation If AddressFix is selected"},
{"code":70010,"name":"Controlling Person. Address. AddressFree","description":"","action":"Validation If AddressFree is selected"},
{"code":70011,"name":"Organisation Account Holder.IN","description":"","action":"Mandatory"},
{"code":70012,"name":"Organisation Account Holder.Name","description":"","action":"Validation"},
{"code":70013,"name":"Organisation Account Holder. Address. AddressFix.City","description":"","action":"Validation If AddressFix is selected"},
{"code":70014,"name":"Organisation Account Holder. Address. AddressFree","description":"","action":"Validation If AddressFree is selected"},
{"code":70015,"name":"ReportingFI .IN","description":"","action":"Mandatory"},
{"code":70016,"name":"ReportingFI.Name","description":"","action":"Validation"},
{"code":70017,"name":"ReportingFI. Address. AddressFix.City","description":"","action":"Validation If AddressFix is selected"},
{"code":70018,"name":"ReportingFI. Address. AddressFree","description":"","action":"Validation If AddressFree is selected"},
{"code":70019,"name":"AccountNumber","description":"","action":"Validation Note: Use “NANUM” for No Account Number."},
{"code":80012,"name":"Reporting Period","description":"A message must not contain data for two different Reporting Periods.","action":""},
{"code":80015,"name":"CrsBody","description":"The CrsBody can be omitted only when the MessageTypeIndic is CRS703 (Nil reporting) and the SendingCompanyIN is omitted, i.e. only in the case of Nil reporting between Competent Authorities. In all other case, the CrsBody must be provided","action":""},
{"code":90000,"name":"TIN structure","description":"The TIN structure in invalid","action":""},
{"code":90001,"name":"TIN algorithm","description":"The TIN is not invalid against the algorithm","action":""},
{"code":90002,"name":"Invalid TIN semantic","description":"The TIN does not have a valid semantic","action":""},
{"code":-1,"name":"UNKNOWN","description":"","action":""},
{"code":100,"name":"REGISTERED","description":"","action":""},
{"code":198,"name":"IMPORTED_FIX","description":"","action":""},
{"code":199,"name":"IMPORTED","description":"","action":""},
{"code":200,"name":"VALIDATE_ZIP_OK","description":"","action":""},
{"code":210,"name":"VALIDATE_ZIP_MD_OK","description":"","action":""},
{"code":220,"name":"VALIDATE_ZIP_KEY_OK","description":"","action":""},
{"code":230,"name":"VALIDATE_ZIP_PYLD_OK","description":"","action":""},
{"code":300,"name":"VALIDATE_SCHEMA_OK","description":"","action":""},
{"code":400,"name":"VALIDATE_SIGNATURE_OK","description":"","action":""},
{"code":500,"name":"VALIDATE_RULES_OK","description":"","action":""},
{"code":600,"name":"GEN_STATUS_OK","description":"","action":""},
{"code":700,"name":"DELIVERY_OK","description":"","action":""},
{"code":800,"name":"DELIVERED_OK","description":"","action":""},
{"code":900,"name":"VALIDATE_OK","description":"","action":""},
{"code":1000,"name":"RESEND_OK","description":"","action":""},
{"code":1001,"name":"UNRESEND_OK","description":"","action":""},
{"code":5100,"name":"DISABLED","description":"","action":""},
{"code":5200,"name":"VALIDATE_ZIP_ER","description":"","action":""},
{"code":5210,"name":"VALIDATE_ZIP_MD_ER","description":"","action":""},
{"code":5220,"name":"VALIDATE_ZIP_KEY_ER","description":"","action":""},
{"code":5230,"name":"VALIDATE_ZIP_PYLD_ER","description":"","action":""},
{"code":5300,"name":"VALIDATE_SCHEMA_ER","description":"","action":""},
{"code":5400,"name":"VALIDATE_SIGNATURE_ER","description":"","action":""},
{"code":5500,"name":"VALIDATE_RULES_ER","description":"","action":""},
{"code":5600,"name":"GEN_STATUS_ER","description":"","action":""},
{"code":5700,"name":"DELIVERY_ER","description":"","action":""},
{"code":5800,"name":"DELIVERED_ER","description":"","action":""},
{"code":5900,"name":"VALIDATE_ER","description":"","action":""}]
